
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/cocoide/aws-ecs/actions/runs/4289650151)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-00ec53614ec162c10]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-04a0e1e6a67e9c9e5]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0706f7119af5cd4c0]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02172262f4929ea4a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-059b2d6513f7016a6]
aws_security_group.alb: Refreshing state... [id=sg-02b7bf20624cca338]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09f530f2af3d06382]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c4aade2c33e61df0]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ea504b634a38d765]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-064b9ce76f2caea7b]
aws_security_group.ecs: Refreshing state... [id=sg-03e925085929b2a2a]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09e0fb9f71f4b1bc1]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0671aa01347b05132]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a1ea0282dfeb569b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-064b9ce76f2caea7b1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-080f75e69f7af2f8e]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-970747601]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0da0c116dd0f80bd8]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c70654710f5f82e7]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0529bf93ccc0ef0ac]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0d09bd6559194d43e]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09e0fb9f71f4b1bc11080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c4aade2c33e61df01080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "golang-server-alb"
      + preserve_host_header       = false
      + security_groups            = [
          + "sg-02b7bf20624cca338",
        ]
      + subnets                    = [
          + "subnet-0671aa01347b05132",
          + "subnet-09f530f2af3d06382",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "golang-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0706f7119af5cd4c0"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 3s [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:targetgroup/golang-server-target-group/d8ad3df87212743b]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Still creating... [2m20s elapsed]
aws_lb.alb: Creation complete after 2m26s [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:loadbalancer/app/golang-server-alb/b4a4f8080b3efb6d]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:listener/app/golang-server-alb/b4a4f8080b3efb6d/6277e5de37148c72]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:263325745760:listener-rule/app/golang-server-alb/b4a4f8080b3efb6d/6277e5de37148c72/61278361fb6be1ce]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"423a1d53fc4e4891fac241a21fe5ba9e00ef93a1","Vars":{},"WorkflowName":"Terraform"} -->